## There are alternative solution and hits: 
### more readable
> 10, 18, 23, 24, 25, 28, 37, 38, 44, 54, 58, 60, 66, 71
### more effient (vectorlized)
> 16, 19, 24, 43, 62
### when to use it?
> 13, 26, 36, 39, 41, 58, 60, 67
### hints
> 12, 18, 22, 24, 28, 29, 30, 33, 56, 59, 66, 67, 72

# Pandas 101

In [1]:
import pandas as pd
from IPython.core.display import display

In [2]:
# 1. How to import pandas and check the version? 
print(pd.__version__)
print(pd.show_versions(as_json=True))

1.0.1
{'system': {'commit': None, 'python': '3.7.6.final.0', 'python-bits': 64, 'OS': 'Darwin', 'OS-release': '16.7.0', 'machine': 'x86_64', 'processor': 'i386', 'byteorder': 'little', 'LC_ALL': 'None', 'LANG': 'zh_TW.UTF-8', 'LOCALE': 'zh_TW.UTF-8'}, 'dependencies': {'pandas': '1.0.1', 'numpy': '1.16.5', 'pytz': '2019.3', 'dateutil': '2.8.1', 'pip': '20.0.2', 'setuptools': '45.2.0.post20200210', 'Cython': None, 'pytest': '5.4.1', 'hypothesis': None, 'sphinx': None, 'blosc': None, 'feather': None, 'xlsxwriter': '1.2.8', 'lxml.etree': '4.5.0', 'html5lib': None, 'pymysql': None, 'psycopg2': None, 'jinja2': '2.11.1', 'IPython': '7.12.0', 'pandas_datareader': None, 'bs4': '4.9.0', 'bottleneck': None, 'fastparquet': None, 'gcsfs': None, 'matplotlib': '3.2.1', 'numexpr': None, 'odfpy': None, 'openpyxl': None, 'pandas_gbq': None, 'pyarrow': None, 'pytables': None, 'pyxlsb': None, 's3fs': None, 'scipy': '1.4.1', 'sqlalchemy': None, 'tables': None, 'tabulate': None, 'xarray': None, 'xlrd': None, 'xlwt': None, 'numba': '0.49.1'}}
None

In [3]:
# 2. How to create a series from a list, numpy array and dict?
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

ser1 = pd.Series(mylist)
ser2 = pd.Series(myarr)
ser3 = pd.Series(mydict)

In [4]:
# 3. How to convert the index of a series into a column of a dataframe?
# L1
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

df = ser.to_frame().reset_index()
df.head()

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

In [5]:
# 4. How to combine many series to form a dataframe?
# L1
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

df = pd.concat([ser1, ser2], axis=1)
df.head()

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

In [6]:
# 5. How to assign name to the series’ index?
# L1
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

ser.name = 'alphabets'

In [7]:
# 6. How to get the items of series A not present in series B?
# L2
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

mask = ~ ser1.isin(ser2)
ser1[mask]

0    1
1    2
2    3
dtype: int64

In [8]:
# 7. How to get the items not common to both series A and series B?
# L2
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

union_ser = pd.Series(np.union1d(ser1, ser2))
intersection_ser = pd.Series(np.intersect1d(ser1, ser2))
xor_ser = union_ser[~ union_ser.isin(intersection_ser)]
xor_ser

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

In [9]:
# 8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?
# L2
ser = pd.Series(np.random.normal(10, 5, 25))
ser.quantile([.0, .25, .5, .75, 1])

0.00     0.648797
0.25     8.473093
0.50     9.222865
0.75    11.681689
1.00    16.374119
dtype: float64

In [10]:
# 9. How to get frequency counts of unique items of a series?
#  L1
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
ser.value_counts()

b    7
a    6
f    4
c    3
h    3
d    3
g    2
e    2
dtype: int64

In [11]:
# 10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?
# L2
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

# More Readable
top_2_frequent = ser.value_counts().nlargest(2).index
ser.where(ser.isin(top_2_frequent), other='Other')

0     Other
1         1
2         2
3         1
4     Other
5         2
6         2
7     Other
8         1
9     Other
10        2
11        2
dtype: object

In [12]:
#  11. How to bin a numeric series to 10 groups of equal size?
#  L2
ser = pd.Series(np.random.random(20))

pd.qcut(ser,
        q = [0, .1, .2, .3, .4, .5, .6, .7, .8, .9, 1],
        labels=['1st', '2nd','3rd','4th','5th',
                 '6th', '7th', '8th','9th', '10th'])

# hint 
# 使用qcut輸出的series, dtype為categorical, 各個value之間可以進行比較

0      6th
1      7th
2      1st
3      5th
4      1st
5     10th
6      2nd
7      8th
8      4th
9      4th
10     9th
11     7th
12     9th
13     5th
14     3rd
15    10th
16     3rd
17     6th
18     8th
19     2nd
dtype: category
Categories (10, object): [1st < 2nd < 3rd < 4th ... 7th < 8th < 9th < 10th]

In [13]:
# 12. How to convert a numpy array to a dataframe of given shape? (L1)
# L1
ser = pd.Series(np.random.randint(1, 10, 35))


pd.DataFrame(ser.values.reshape(7,-1))
# hint
# 參數 -1 --> 處理好剩下的dimension，在此例中，(7,-1) --> (7, 35/7)

   0  1  2  3  4
0  1  2  1  4  9
1  9  5  5  5  4
2  2  7  7  3  5
3  5  1  2  4  1
4  9  6  6  3  1
5  7  3  5  2  7
6  7  5  7  1  8

In [14]:
# 13. How to find the positions of numbers that are multiples of 3 from a series?
# L2
ser = pd.Series(np.random.randint(1, 10, 7))



# np.argwhere(ser % 3 == 0)

# hint
# np.where, pd.where 傳回整個series
# np.argwhere 傳回index

In [15]:
# 14. How to extract items at given positions from a series
# L1
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

ser.iloc[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

In [16]:
# 15. How to stack two series vertically and horizontally ?
# Difficulty Level: L1
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

df1 = pd.concat([ser1,ser2], axis='index').to_frame()
df2 = pd.concat([ser1,ser2], axis='columns')
display(df1.head(), df2)

   0
0  0
1  1
2  2
3  3
4  4

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [17]:
# 16. How to get the positions of items of series A in another series B?
# Difficulty Level: L2
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

# vectorlized
mask = ser1.isin(ser2)
np.argwhere(mask.values).reshape(-1).tolist()

# np.where進行項量化的操作, 在資料量大時可以保證一定的速度

[0, 4, 5, 8]

In [18]:
# 17. How to compute the mean squared error on a truth and predicted series?
# Difficulty Level: L2
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

print((truth - pred).pow(2).sum() / len(truth))
print(np.mean((truth - pred) ** 2))

0.3365931254365413
0.3365931254365413

In [19]:
# 18. How to convert the first character of each element in a series to uppercase?
# Difficulty Level: L2
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

# More readable
ser.str.capitalize()
# Hints
# 使用dir來得到所有 ser.str中的屬性及方法
# 如此一來可以更全面的了解有什麼屬性及方法可以call
# print(dir(ser.str))

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [20]:
# 19. How to calculate the number of characters in each word in a series?
# Difficulty Level: L2
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

# vectorlzied

ser.str.len()

0    3
1    2
2    4
3    4
dtype: int64

In [21]:
# 20. How to compute difference of differences between consequtive numbers of a series?
# Difficulty Level: L1
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

# Solition 1
tmp = ser.shift(1)
middle_result = ser - tmp
print(middle_result.tolist())
tmp2 = middle_result.shift(1)
print((middle_result - tmp2).tolist())

# Solution 2
print('-'*60)
print(ser.diff().tolist())
print(ser.diff().diff().tolist())

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]
------------------------------------------------------------
[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

In [22]:
# 21. How to convert a series of date-strings to a timeseries?
# Difficiulty Level: L2

ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

pd.to_datetime(ser, infer_datetime_format=True)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [23]:
# 22. How to get the day of month, week number, day of year and day of week from a series of date strings?
# Difficiulty Level: L2

ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

tmp = pd.to_datetime(ser)

# hint
# 使用 dir(tmp.dt) 來確認有什麼屬性/方法可以call
# tmp.dt為pandas.core.indexes.accessors.DatetimeProperties 物件
# 使用dir(tmp[0])  來確認有什麼屬性/方法可以call
# tmp[0]為<class 'pandas._libs.tslibs.timestamps.Timestamp'> 物件
#  pandas timestamp文件
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Timestamp.html
#  dateutil 文件，處理時間資料時非常常用
# https://dateutil.readthedocs.io/en/stable/index.html



Date = tmp.dt.day.tolist()
Week_number = tmp.dt.weekofyear.tolist()
Day_num_of_year = tmp.dt.dayofyear.tolist()
Dayofweek = tmp.dt.weekday.tolist()

print(f''' 
Date : {Date}
Week number : {Week_number}
Day num of year : {Day_num_of_year}
Day of week : {Dayofweek}
''')

Date : [1, 2, 3, 4, 5, 6]
Week number : [53, 5, 9, 14, 19, 23]
Day num of year : [1, 33, 63, 94, 125, 157]
Day of week : [4, 2, 5, 3, 0, 5]

In [24]:
# 23. How to convert year-month string to dates corresponding to the 4th day of the month?
# Difficiulty Level: L2
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])

# more readable
pd.to_datetime(ser, infer_datetime_format=True)

0   2010-01-01
1   2011-02-01
2   2012-03-01
dtype: datetime64[ns]

In [25]:
# 24. How to filter words that contain atleast 2 vowels from a series?
# Difficiulty Level: L3

ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])


# more readable
# vectorlized
condition = ser.str.count('[aeiouAEIOU]') >= 2
ser[condition]

0     Apple
1    Orange
4     Money
dtype: object

* hint
    * <img src = "./images/RegExp_snap.png"></img>
    * pandas中的Series.str方法是向量化的，且通常都支援正則表達式(RegExp)
    * 正則表達式可以幫助我們處理很多文字問題
    * 像圖中的[aeiou]搭配[AEIUO] --> [aeiuoAEIUO]就解決了此題
    * 或許你會想看看這份在[菜鳥上的教學](http://www.runoob.com/python/python-reg-expressions.html)

In [26]:
# 25. How to filter valid emails from a series?
# Difficiulty Level: L3

# Extract the valid emails from the series emails. The regex pattern for valid emails is provided as reference.

emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

# More readable
condition = emails.str.contains(pattern)
emails[condition].tolist()

['rameses@egypt.com', 'matt@t.co', 'narendra@modi.com']

In [27]:
# 26. How to get the mean of a series grouped by another series?
# Difficiulty Level: L2
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
print(weights.tolist())
print(fruit.tolist())

print()
print(weights.groupby(fruit).mean())

# ALTERNATIVE SULOTION
tmp = pd.DataFrame({'fruit':fruit, 
              'weights':weights}).groupby('fruit').mean()

tmp['weights'].index.name = ''
print(tmp['weights'])

# When to use?
# 操作dataframe時我們通常都直接在dataframe裡面groupby, 這題告訴我們
# series 可以 groupby 另一條series, 之間用index作為對應, 
# 這讓feature engineering時能夠有更好的彈性

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
['carrot', 'carrot', 'banana', 'carrot', 'banana', 'apple', 'apple', 'banana', 'apple', 'apple']

apple     8.000000
banana    5.333333
carrot    2.333333
dtype: float64

apple     8.000000
banana    5.333333
carrot    2.333333
Name: weights, dtype: float64

In [28]:
# 27. How to compute the euclidean distance between two series?
# Difficiulty Level: L2

p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

sum((p - q) ** 2) ** 0.5

18.16590212458495

In [29]:
# # 28. How to find all the local maxima (or peaks) in a numeric series?
# # Difficiulty Level: L3

# # Get the positions of peaks (values surrounded by smaller values on both sides) in ser.

# ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

# # more readable
# peak_locs = np.argwhere(np.sign(ser.diff(1)) +\
#                         np.sign(ser.diff(-1)) == 2).reshape(-1) 

# # hint
# # 使用diff(-1)，來取得backward
# # 同樣性質的方法還有pd.Series.shift
# peak_locs

In [30]:
# 29. How to replace missing spaces in a string with the least frequent character?
# Replace the spaces in my_str with the least frequent character.

# Difficiulty Level: L2

# hint 
# 此例示範了如何將所有series中的string coacat在一起

ser = pd.Series(list('dbc deb abed gade'))
freq = ser.value_counts()
print(freq)
least_freq = freq.dropna().index[-1]
result = "".join(ser.replace(' ', least_freq))
print(result)

# ALTERNATIVE SOLUTION
my_str = 'dbc deb abed gade'

least_freq_character = pd.Series(list(my_str)).value_counts().index[-1]

my_str.replace(' ', least_freq_character)

d    4
b    3
     3
e    3
a    2
c    1
g    1
dtype: int64
dbcgdebgabedggade

'dbcgdebgabedggade'

In [31]:
# 30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?
# Difficiulty Level: L2
dateime_idx = pd.date_range('2000-01-01', periods=10, freq='W-SAT')

pd.Series(index = dateime_idx,
          data = np.random.randint(2,8,size=len(dateime_idx)))
# hint 
# 要在pandas中找到pd.date_range這個方法實在很難找......
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.date_range.html

2000-01-01    4
2000-01-08    3
2000-01-15    7
2000-01-22    3
2000-01-29    4
2000-02-05    6
2000-02-12    3
2000-02-19    4
2000-02-26    3
2000-03-04    5
Freq: W-SAT, dtype: int64

In [32]:
# 30 - 2
# create date index / date column - with dataframe length
from datetime import datetime, timedelta

data = np.random.randint(2, 8, size=100)

date_start = datetime(2018, 1, 1)
days = pd.date_range(date_start,
                     date_start + timedelta(len(data) - 1),
                     freq='D') # sart, end, freq



# days = pd.date_range('2018-01-01', periods=1, freq='D')
df = pd.DataFrame({'value':data,'date':days})

display(df.head(),
       df.dtypes,
       df.set_index('date'))

   value       date
0      5 2018-01-01
1      4 2018-01-02
2      7 2018-01-03
3      2 2018-01-04
4      3 2018-01-05

value             int64
date     datetime64[ns]
dtype: object

            value
date
2018-01-01      5
2018-01-02      4
2018-01-03      7
2018-01-04      2
2018-01-05      3
...           ...
2018-04-06      7
2018-04-07      4
2018-04-08      4
2018-04-09      4
2018-04-10      2

[100 rows x 1 columns]

In [33]:
# 31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?
# Difficiulty Level: L2

ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))

# Fill the datetime index using resample + ffill()
ser.resample('D').ffill()

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

In [34]:
# 32. How to compute the autocorrelations of a numeric series?
# Difficiulty Level: L3

# Compute autocorrelations for the first 10 lags of ser. Find out which lag has the largest correlation.

ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

# ALTERNATIVE　SOLUTION
tmp = pd.Series([abs(ser.autocorr(lag)) for lag in range(1,11)])
tmp.sort_values(ascending=False).head(1)

7    0.404444
dtype: float64

In [35]:
# 33. How to import only every nth row from a csv file to create a dataframe?
# Difficiulty Level: L2

# Import every 50th row of BostonHousing dataset as a dataframe.
url = 'https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv'



df = pd.read_csv(url, chunksize=50)

df_result = pd.concat([chunk.iloc[0] for chunk in df], axis=1)

df_result.T
# Hint
# pd.read_csv(**param, chunksize=50)
# 會return TextFileReader物件, 是可遞迴物件
# 可以經由以下確認
# print(type(df))

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
50,0.08873,21.0,5.64,0.0,0.439,5.963,45.7,6.8147,4.0,243.0,16.8,395.56,13.45,19.7
100,0.14866,0.0,8.56,0.0,0.520,6.727,79.9,2.7778,5.0,384.0,20.9,394.76,9.42,27.5
150,1.65660,0.0,19.58,0.0,0.871,6.122,97.3,1.6180,5.0,403.0,14.7,372.80,14.10,21.5
200,0.01778,95.0,1.47,0.0,0.403,7.135,13.9,7.6534,3.0,402.0,17.0,384.30,4.45,32.9
250,0.14030,22.0,5.86,0.0,0.431,6.487,13.0,7.3967,7.0,330.0,19.1,396.28,5.90,24.4
300,0.04417,70.0,2.24,0.0,0.400,6.871,47.4,7.8278,5.0,358.0,14.8,390.86,6.07,24.8
350,0.06211,40.0,1.25,0.0,0.429,6.490,44.4,8.7921,1.0,335.0,19.7,396.90,5.98,22.9
400,25.04610,0.0,18.10,0.0,0.693,5.987,100.0,1.5888,24.0,666.0,20.2,396.90,26.77,5.6
450,6.71772,0.0,18.10,0.0,0.713,6.749,92.6,2.3236,24.0,666.0,20.2,0.32,17.44,13.4
500,0.22438,0.0,9.69,0.0,0.585,6.027,79.7,2.4982,6.0,391.0,19.2,396.90,14.33,16.8

In [36]:
# 34. How to change column values when importing csv to a dataframe?
# Difficulty Level: L2

# Import the boston housing dataset, but while importing change the 'medv' (median house value) column so that values < 25 becomes ‘Low’ and > 25 becomes ‘High’.

url = 'https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv'
converters = {'medv': lambda x :'High' if float(x) > 25
                                       else 'Low'}
df = pd.read_csv(url, converters=converters)
df.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,Low
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,Low
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,High
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,High
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,High

In [37]:
# 35. How to create a dataframe with rows as strides from a given series?
# Difficiulty Level: L3

L = pd.Series(range(15))

def gen_strides(a, stride_len=5, window_len=5):
    n_strides = ((a.size-window_len)//stride_len) + 1
    return np.array([a[s:(s+window_len)] for s in np.arange(0, a.size, stride_len)[:n_strides]])

gen_strides(L, stride_len=2, window_len=4)

array([[ 0,  1,  2,  3],
       [ 2,  3,  4,  5],
       [ 4,  5,  6,  7],
       [ 6,  7,  8,  9],
       [ 8,  9, 10, 11],
       [10, 11, 12, 13]])

In [38]:
# 36. How to import only specified columns from a csv file?
# Difficulty Level: L1

url = 'https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv'
cols = ['crim','medv']
pd.read_csv(url, usecols=cols).head()

# When to use
# 資料量大時，硬體記憶體不足，只讀取幾個column做特徵工程
# 並存取特徵結果

      crim  medv
0  0.00632  24.0
1  0.02731  21.6
2  0.02729  34.7
3  0.03237  33.4
4  0.06905  36.2

In [39]:
# 37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.
# Difficulty Level: L2
url = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
df = pd.read_csv(url)

# More readable
display(
df.shape,
df.dtypes,
df.describe()
)
# get np.array and list
array = df.values
df_list = df.values.tolist()

(93, 27)

Manufacturer           object
Model                  object
Type                   object
Min.Price             float64
Price                 float64
Max.Price             float64
MPG.city              float64
MPG.highway           float64
AirBags                object
DriveTrain             object
Cylinders              object
EngineSize            float64
Horsepower            float64
RPM                   float64
Rev.per.mile          float64
Man.trans.avail        object
Fuel.tank.capacity    float64
Passengers            float64
Length                float64
Wheelbase             float64
Width                 float64
Turn.circle           float64
Rear.seat.room        float64
Luggage.room          float64
Weight                float64
Origin                 object
Make                   object
dtype: object

,Min.Price,Price,Max.Price,MPG.city,MPG.highway,EngineSize,Horsepower,RPM,Rev.per.mile,Fuel.tank.capacity,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight
count,86.000000,91.000000,88.000000,84.000000,91.000000,91.000000,86.000000,90.000000,87.000000,85.000000,91.000000,89.000000,92.000000,87.000000,88.000000,89.000000,74.000000,86.000000
mean,17.118605,19.616484,21.459091,22.404762,29.065934,2.658242,144.000000,5276.666667,2355.000000,16.683529,5.076923,182.865169,103.956522,69.448276,38.954545,27.853933,13.986486,3104.593023
std,8.828290,9.724280,10.696563,5.841520,5.370293,1.045845,53.455204,605.554811,486.916616,3.375748,1.045953,14.792651,6.856317,3.778023,3.304157,3.018129,3.120824,600.129993
min,6.700000,7.400000,7.900000,15.000000,20.000000,1.000000,55.000000,3800.000000,1320.000000,9.200000,2.000000,141.000000,90.000000,60.000000,32.000000,19.000000,6.000000,1695.000000
25%,10.825000,12.350000,14.575000,18.000000,26.000000,1.800000,100.750000,4800.000000,2017.500000,14.500000,4.000000,174.000000,98.000000,67.000000,36.000000,26.000000,12.000000,2647.500000
50%,14.600000,17.700000,19.150000,21.000000,28.000000,2.300000,140.000000,5200.000000,2360.000000,16.500000,5.000000,181.000000,103.000000,69.000000,39.000000,27.500000,14.000000,3085.000000
75%,20.250000,23.500000,24.825000,25.000000,31.000000,3.250000,170.000000,5787.500000,2565.000000,19.000000,6.000000,192.000000,110.000000,72.000000,42.000000,30.000000,16.000000,3567.500000
max,45.400000,61.900000,80.000000,46.000000,50.000000,5.700000,300.000000,6500.000000,3755.000000,27.000000,8.000000,219.000000,119.000000,78.000000,45.000000,36.000000,22.000000,4105.000000

In [42]:
# # 38. How to extract the row and column number of a particular cell with given criterion?
# # Difficulty Level: L1

# df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# # More Readable
# highest_price = df['Price'].max()
# # the dataframe rows
# df.query(f'Price == {highest_price}')
# # the row idx and col idx
# row, col = np.argwhere(df.values == np.max(df.Price)).reshape(-1)
# print(row, col)

In [43]:
# # 39. How to rename a specific columns in a dataframe?
# # Difficulty Level: L2

# # Rename the column Type as CarType in df and replace the ‘.’ in column names with ‘_’.
# df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# tmp = [col.replace('.','_') for col in df.columns]
# df.columns = tmp
# df = df.rename(columns={'Type':'CarType'})
# df.columns

# # When to use
# # 第一次拿到資料時，針對特徵欄位做資料清理
# # 甚至會加註categorical feature CAT_FeatureName
# # Numerical feature Num_FeatureName......等

In [44]:
# # 40. How to check if a dataframe has any missing values?
# # Difficulty Level: L1
# df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# df.isnull().any().any()

In [45]:
# # 41. How to count the number of missing values in each column?
# # Difficulty Level: L2
# df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# nan_p_series = df.isnull().sum() / len(df)
# nan_p_series.sort_values(ascending=False).head(1)

# # when to use
# # 缺失值統計，近乎每次必用

In [46]:
# # 42. How to replace missing values of multiple numeric columns with the mean?
# # Difficulty Level: L2

# df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# for col in ['Min.Price','Max.Price']:
#     respective_mean = df[col].mean()
#     df[col] = df[col].fillna(respective_mean)

# df[['Min.Price','Max.Price']].isnull().any().any()

In [47]:
# # 43. How to use apply function on existing columns with global variables as additional arguments?
# # Difficulty Level: L3

# # In df, use apply method to replace the missing values in Min.Price with the column’s mean and those in Max.Price with the column’s median.

# df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# d = {'Min.Price': np.nanmean, 'Max.Price': np.nanmedian}
# df[['Min.Price', 'Max.Price']] = df[['Min.Price', 'Max.Price']]\
# .apply(lambda x, d: x.fillna(d[x.name](x)), args=(d, ))

# # Vectorlized 
# # 使用 42題的方式，改成median填入，是向量化操作
# # 在資料量大時會快非常多

In [48]:
# 44. How to select a specific column from a dataframe as a dataframe instead of a series?
# Difficulty Level: L2

df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

# More readable

df[['a']]

    a
0   0
1   5
2  10
3  15

In [49]:
# 45. How to change the order of columns of a dataframe?
# Difficulty Level: L3
# Actually 3 questions.

# In df, interchange columns 'a' and 'c'.
# Create a generic function to interchange two columns, without hardcoding column names.

# Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

# 1
df[list('cbade')]

# 2 
# no function to do that
def swap_col(df, col1, col2):
    df_swap = df.copy()
    col_list = list(df_swap.columns)
    col1_idx = col_list.index(col1)
    col2_idx = col_list.index(col2)
    col_list[col1_idx] = col2
    col_list[col2_idx] = col1
    
    return df_swap[col_list]

swap_col(df, 'c','e')

# 3
new_order = sorted(list(df.columns), reverse=True)
df[new_order]

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

In [50]:
# 46. How to set the number of rows and columns displayed in the output?
# Difficulty Level: L2

# Change the pamdas display settings on printing the dataframe df it shows a maximum of 10 rows and 10 columns.

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
# 找到所有可用的set_option
# pd.describe_option()
pd.set_option('display.max_columns', 10) 
pd.set_option('display.max_rows', 10) 
df

,Manufacturer,Model,Type,Min.Price,Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,...,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,...,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,...,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,...,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,...,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,...,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,...,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,...,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,...,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,...,30.0,15.0,3245.0,non-USA,Volvo 850

In [51]:
pd.describe_option()

compute.use_bottleneck : bool
    Use the bottleneck library to accelerate if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
compute.use_numexpr : bool
    Use the numexpr library to accelerate computation if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
display.chop_threshold : float or None
    if set to a float value, all float values smaller then the given threshold
    will be displayed as exactly 0 by repr and friends.
    [default: None] [currently: None]
display.colheader_justify : 'left'/'right'
    Controls the justification of column headers. used by DataFrameFormatter.
    [default: right] [currently: right]
display.column_space No description available.
    [default: 12] [currently: 12]
display.date_dayfirst : boolean
    When True, prints and parses dates with the day first, eg 20/01/2005
    [default: False] [currently: False]
display.date_yearfirst : boolean
    When True, prints and parses dates with the year first, eg 2005/01/20
    [default: False] [currently: False]
display.encoding : str/unicode
    Defaults to the detected encoding of the console.
    Specifies the encoding to be used for strings returned by to_string,
    these are generally strings meant to be displayed on the console.
    [default: UTF-8] [currently: UTF-8]
display.expand_frame_repr : boolean
    Whether to print out the full DataFrame repr for wide DataFrames across
    multiple lines, `max_columns` is still respected, but the output will
    wrap-around across multiple "pages" if its width exceeds `display.width`.
    [default: True] [currently: True]
display.float_format : callable
    The callable should accept a floating point number and return
    a string with the desired format of the number. This is used
    in some places like SeriesFormatter.
    See formats.format.EngFormatter for an example.
    [default: None] [currently: None]
display.html.border : int
    A ``border=value`` attribute is inserted in the ``<table>`` tag
    for the DataFrame HTML repr.
    [default: 1] [currently: 1]
display.html.table_schema : boolean
    Whether to publish a Table Schema representation for frontends
    that support it.
    (default: False)
    [default: False] [currently: False]
display.html.use_mathjax : boolean
    When True, Jupyter notebook will process table contents using MathJax,
    rendering mathematical expressions enclosed by the dollar symbol.
    (default: True)
    [default: True] [currently: True]
display.large_repr : 'truncate'/'info'
    For DataFrames exceeding max_rows/max_cols, the repr (and HTML repr) can
    show a truncated table (the default from 0.13), or switch to the view from
    df.info() (the behaviour in earlier versions of pandas).
    [default: truncate] [currently: truncate]
display.latex.escape : bool
    This specifies if the to_latex method of a Dataframe uses escapes special
    characters.
    Valid values: False,True
    [default: True] [currently: True]
display.latex.longtable :bool
    This specifies if the to_latex method of a Dataframe uses the longtable
    format.
    Valid values: False,True
    [default: False] [currently: False]
display.latex.multicolumn : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: True] [currently: True]
display.latex.multicolumn_format : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: l] [currently: l]
display.latex.multirow : bool
    This specifies if the to_latex method of a Dataframe uses multirows
    to pretty-print MultiIndex rows.
    Valid values: False,True
    [default: False] [currently: False]
display.latex.repr : boolean
    Whether to produce a latex DataFrame representation for jupyter
    environments that support it.
    (default: False)
    [default: False] [currently: False]
display.max_categories : int
    This sets the maximum number of categories pandas should output when
    printing out a `Categorical` or a Series of dtype "category".
    [default: 8] [currently: 8]
display.max_columns : int
    If max_cols is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the width of the terminal and print a truncated object which fits
    the screen width. The IPython notebook, IPython qtconsole, or IDLE
    do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 20] [currently: 10]
display.max_colwidth : int or None
    The maximum width in characters of a column in the repr of
    a pandas data structure. When the column overflows, a "..."
    placeholder is embedded in the output. A 'None' value means unlimited.
    [default: 50] [currently: 50]
display.max_info_columns : int
    max_info_columns is used in DataFrame.info method to decide if
    per column information will be printed.
    [default: 100] [currently: 100]
display.max_info_rows : int or None
    df.info() will usually show null-counts for each column.
    For large frames this can be quite slow. max_info_rows and max_info_cols
    limit this null check only to frames with smaller dimensions than
    specified.
    [default: 1690785] [currently: 1690785]
display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 10]
display.max_seq_items : int or None
    when pretty-printing a long sequence, no more then `max_seq_items`
    will be printed. If items are omitted, they will be denoted by the
    addition of "..." to the resulting string.

    If set to None, the number of items to be printed is unlimited.
    [default: 100] [currently: 100]
display.memory_usage : bool, string or None
    This specifies if the memory usage of a DataFrame should be displayed when
    df.info() is called. Valid values True,False,'deep'
    [default: True] [currently: True]
display.min_rows : int
    The numbers of rows to show in a truncated view (when `max_rows` is
    exceeded). Ignored when `max_rows` is set to None or 0. When set to
    None, follows the value of `max_rows`.
    [default: 10] [currently: 10]
display.multi_sparse : boolean
    "sparsify" MultiIndex display (don't display repeated
    elements in outer levels within groups)
    [default: True] [currently: True]
display.notebook_repr_html : boolean
    When True, IPython notebook will use html representation for
    pandas objects (if it is available).
    [default: True] [currently: True]
display.pprint_nest_depth : int
    Controls the number of nested levels to process when pretty-printing
    [default: 3] [currently: 3]
display.precision : int
    Floating point output precision (number of significant digits). This is
    only a suggestion
    [default: 6] [currently: 6]
display.show_dimensions : boolean or 'truncate'
    Whether to print out dimensions at the end of DataFrame repr.
    If 'truncate' is specified, only print out the dimensions if the
    frame is truncated (e.g. not display all rows and/or columns)
    [default: truncate] [currently: truncate]
display.unicode.ambiguous_as_wide : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.unicode.east_asian_width : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.width : int
    Width of the display in characters. In case python/IPython is running in
    a terminal this can be set to None and pandas will correctly auto-detect
    the width.
    Note that the IPython notebook, IPython qtconsole, or IDLE do not run in a
    terminal and hence it is not possible to correctly detect the width.
    [default: 80] [currently: 80]
io.excel.ods.reader : string
    The default Excel reader engine for 'ods' files. Available options:
    auto, odf.
    [default: auto] [currently: auto]
io.excel.xls.reader : string
    The default Excel reader engine for 'xls' files. Available options:
    auto, xlrd.
    [default: auto] [currently: auto]
io.excel.xls.writer : string
    The default Excel writer engine for 'xls' files. Available options:
    auto, xlwt.
    [default: auto] [currently: auto]
io.excel.xlsb.reader : string
    The default Excel reader engine for 'xlsb' files. Available options:
    auto, pyxlsb.
    [default: auto] [currently: auto]
io.excel.xlsm.reader : string
    The default Excel reader engine for 'xlsm' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsm.writer : string
    The default Excel writer engine for 'xlsm' files. Available options:
    auto, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsx.reader : string
    The default Excel reader engine for 'xlsx' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsx.writer : string
    The default Excel writer engine for 'xlsx' files. Available options:
    auto, openpyxl, xlsxwriter.
    [default: auto] [currently: auto]
io.hdf.default_format : format
    default format writing format, if None, then
    put will default to 'fixed' and append will default to 'table'
    [default: None] [currently: None]
io.hdf.dropna_table : boolean
    drop ALL nan rows when appending to a table
    [default: False] [currently: False]
io.parquet.engine : string
    The default parquet reader/writer engine. Available options:
    'auto', 'pyarrow', 'fastparquet', the default is 'auto'
    [default: auto] [currently: auto]
mode.chained_assignment : string
    Raise an exception, warn, or no action if trying to use chained assignment,
    The default is warn
    [default: warn] [currently: warn]
mode.sim_interactive : boolean
    Whether to simulate interactive mode for purposes of testing
    [default: False] [currently: False]
mode.use_inf_as_na : boolean
    True means treat None, NaN, INF, -INF as NA (old way),
    False means None and NaN are null, but INF, -INF are not NA
    (new way).
    [default: False] [currently: False]
mode.use_inf_as_null : boolean
    use_inf_as_null had been deprecated and will be removed in a future
    version. Use `use_inf_as_na` instead.
    [default: False] [currently: False]
    (Deprecated, use `mode.use_inf_as_na` instead.)
plotting.backend : str
    The plotting backend to use. The default value is "matplotlib", the
    backend provided with pandas. Other backends can be specified by
    prodiving the name of the module that implements the backend.
    [default: matplotlib] [currently: matplotlib]
plotting.matplotlib.register_converters : bool or 'auto'.
    Whether to register converters with matplotlib's units registry for
    dates, times, datetimes, and Periods. Toggling to False will remove
    the converters, restoring any converters that pandas overwrote.
    [default: auto] [currently: auto]

In [52]:
# 47. How to format or suppress scientific notations in a pandas dataframe?
# Difficulty Level: L2

# Suppress scientific notations like ‘e-03’ in df and print upto 4 numbers after decimal.
df = pd.DataFrame(np.random.random(4)**10, columns=['random'])


pd.options.display.float_format = '{:,.4f}'.format

display(df)

# undo
pd.options.display.float_format = None

   random
0  0.0000
1  0.0000
2  0.0012
3  0.0993

In [53]:
# 48. How to format all the values in a dataframe as percentages?
# Difficulty Level: L2

# Format the values in column 'random' of df as percentages.

df = pd.DataFrame(np.random.random(4), columns=['random'])


df.style.format({'random':'{0:.2%}'.format,})

In [54]:
# 49. How to filter every nth row in a dataframe?
# Difficulty Level: L1

# From df, filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# More readable

idx = np.arange(0, df.shape[0], step=20)
col = ['Manufacturer','Model','Type']
df[col].iloc[idx]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

In [56]:
# # 50. How to create a primary key index by combining relevant columns?
# # Difficulty Level: L2

# # In df, Replace NaNs with ‘missing’ in columns 'Manufacturer', 'Model' and 'Type' 
# # and create a index as a combination of these three columns and check if the index is a primary key.

# df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv', usecols=[0,1,2,3,5])

# col = ['Manufacturer','Model','Type']
# idx_col = '.Price'
# df[col] = df[col].fillna('missing')
# df.index = df.Manufacturer + '_' + df.Model + '_' + df.Type
# display(df.head(),
#        df.index.is_unique)
# # When to use
# # 根據column內容來設置 Primary key的手法非常實用
# # 容易給其他同事進行表格閱讀

In [57]:
# 51. How to get the row number of the nth largest value in a column?
# Difficulty Level: L2
# Find the row position of the 5th largest value of column 'a' in df.
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))

# More readable

df['a'].nlargest().index[-1]

9

In [58]:
# 52. How to find the position of the nth largest value greater than a given value?
# Difficulty Level: L2

# In ser, find the position of the 2nd largest value greater than the mean.

# More readable
ser = pd.Series(np.random.randint(1, 100, 15))

tmp = ser - ser.mean()

tmp.nlargest(2).index

Int64Index([11, 5], dtype='int64')

In [59]:
# 53. How to get the last n rows of a dataframe with row RowSum > 100?
# Difficulty Level: L2

# Get the last two rows of df whose row RowSum is greater than 100.
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))

# More readable
df['RowSum'] = df.sum(axis=1)
df.query('RowSum > 100').tail(2)

     0   1   2   3  RowSum
12  36  27  20  34     117
13  35  23  31  39     128

In [60]:
# 54. How to find and cap outliers from a series or dataframe column?
# Difficulty Level: L2

# Replace all values of ser in the lower 5%ile and greater than 95%ile with respective 5th and 95th %ile value.

# More readable
ser = pd.Series(np.logspace(-2, 2, 30))
low = np.quantile(ser, q=.05)
high = np.quantile(ser, q=.95)
ser.clip(low, high)

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
        ...
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
Length: 30, dtype: float64

In [61]:
# 55. How to reshape a dataframe to the largest possible square after removing the negative values?

# Difficulty Level: L3

# Reshape df to the largest possible square with negative values removed.
# Drop the smallest values if need be. 
# The order of the positive numbers in the result should remain the same as the original.

df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))
display(df)
def larget_square(df):
    tmp = df.copy()
    # get positive array
    arr = tmp[tmp > 0].values
    arr = arr[~ np.isnan(arr)]
    # get largest square of side
    N = np.floor(arr.shape[0] ** 0.5).astype(int)
    # get index the arr soted
    top_idx = np.argsort(arr)[::-1]
    # drop min idx satisfied largest square
    # then reshape
    # key point, sort the top_idx, will give us 
    # the original idx already take out minmimum value
    filtered_idx = top_idx[: (N ** 2)]
    result = pd.DataFrame(arr[sorted(filtered_idx)].reshape(N, -1))
    return result

larget_square(df)

    0   1   2   3   4   5   6   7   8   9
0  14   1  13  46  43 -11 -14  32  43  46
1 -15  27  23  -3  46  -5  44   2 -11 -10
2 -12  18  24  24  -9  46  46   0  -4  20
3  41  22  35  13   2  46  13  30 -11  -6
4 -17   8   8  17   6  34 -13  38  -6   7
5  34  49  -5  -4  -9  19  42 -14  32   9
6  21  47 -20  36  29  40 -13  24  32  40
7  45  -7   6 -12  27  -5  41   6  11  22
8  11  27  34  21  42  42  15 -18   3  14
9 -11   7  44  13  15  -7 -14  49 -16  21

      0     1     2     3     4     5     6     7
0  14.0  13.0  46.0  43.0  32.0  43.0  46.0  27.0
1  23.0  46.0  44.0  18.0  24.0  24.0  46.0  46.0
2  20.0  41.0  22.0  35.0  13.0  46.0  13.0  30.0
3   8.0   8.0  17.0   6.0  34.0  38.0   7.0  34.0
4  49.0  19.0  42.0  32.0   9.0  21.0  47.0  36.0
5  29.0  40.0  24.0  32.0  40.0  45.0  27.0  41.0
6  11.0  22.0  11.0  27.0  34.0  21.0  42.0  42.0
7  15.0  14.0   7.0  44.0  13.0  15.0  49.0  21.0

In [62]:
# 56. How to swap two rows of a dataframe?
# Difficulty Level: L2

# Swap rows 1 and 2 in df.

df = pd.DataFrame(np.arange(25).reshape(5, -1))
display(df.head(2))
row1, row2 = df.iloc[0].copy(), df.iloc[1].copy()
df.iloc[0], df.iloc[1] = row2, row1
display(df.head(2))

# Hint
# 使用copy, 否則你的row1, row2和原本的dataframe是連動的

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

   0  1  2  3  4
0  5  6  7  8  9
1  0  1  2  3  4

In [63]:
# 57. How to reverse the rows of a dataframe?
# Difficulty Level: L2

# Reverse all the rows of dataframe df.

df = pd.DataFrame(np.arange(25).reshape(5, -1))

df.iloc[::-1]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

In [64]:
# 58. How to create one-hot encodings of a categorical variable (dummy variables)?
# Difficulty Level: L2

# Get one-hot encodings for column 'a' in the dataframe df and append it as columns.

df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))

# More readable
concat_list = [df.drop(columns=['a']),
              pd.get_dummies(df['a'])]

result = pd.concat(concat_list, axis=1)
result

# When to use
# one hot encoding 非常常用, 其中get_dummy有sparse, drop_first可以選
# 但testing set 或是 validation set 出現unseen column 需要進行處理
# 推薦使用 sklearn.preprocessing, unseen col會使training col 全為0
# https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.OneHotEncoder.html

    b   c   d   e  0  5  10  15  20
0   1   2   3   4  1  0   0   0   0
1   6   7   8   9  0  1   0   0   0
2  11  12  13  14  0  0   1   0   0
3  16  17  18  19  0  0   0   1   0
4  21  22  23  24  0  0   0   0   1

In [65]:
# 59. Which column contains the highest number of row-wise maximum values?
# Difficulty Level: L2

# Obtain the column name with the highest number of row-wise maximum’s in df.


df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))
display(df)
def largest_value_col_row_wise(df):
    tmp = df.copy()
    result_col = []
    for row in range(tmp.shape[0]):
        max_idx = tmp.iloc[row,:].idxmax()
        result_col.append(tmp.columns[max_idx])
    return result_col
result = largest_value_col_row_wise(df)
result

# Hint, pd.Series.argmax 要被棄用了 使用idxmax替代

    0   1   2   3
0  45   7  96  62
1  70  37  31  28
2  25  70  30  14
3   3  50  11  43
4  93  38  10  59
5  53   5   7   6
6  50  49   7  73
7  12  42  26  73
8  56   7  74  87
9  65  69  20  21

[2, 0, 1, 1, 0, 0, 3, 3, 3, 1]

In [66]:
# 60. How to create a new column that contains the row number of nearest column by euclidean distance?
# Create a new column such that, each row contains the row number of nearest row-record by euclidean distance.

# Difficulty Level: L3

df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('pqrs'), index=list('abcdefghij'))
display(df.head())

# more readable
def get_neast_and_euclidean_dist(df):
    from scipy.spatial.distance import pdist, squareform
    row_name = df.index.tolist()
    dist = pdist(df, 'euclidean')
    df_dist = pd.DataFrame(squareform(dist), columns=row_name, index=row_name)
    
    nearest_list = []
    nearest_dist_list = []
    # instead of list comprehension
    # for loop is more readable for complex operation
    for row in df_dist.index:
        nearest_info = df_dist.loc[row, :].sort_values()
        nearest_idx, nearest_dist = nearest_info.index[1], nearest_info.values[1]
        nearest_list.append(nearest_idx)
        nearest_dist_list.append(nearest_dist)
    df_dist['nearset'] = nearest_list
    df_dist['dist'] = nearest_dist_list
    
    return df_dist
get_neast_and_euclidean_dist(df)

# when to use
# 計算距離時, pdist, squareform
# 提供了非常多基於numpy計算的距離，包含euclidean, cosine, correlation,
# hamming, 等等, 非常實用

    p   q   r   s
a  55  96  52  19
b  70  49  19  17
c  58  76   1  31
d  26   3  97  13
e  75  45  65  26

,a,b,c,d,e,...,h,i,j,nearset,dist
a,0.000000,59.388551,56.160484,107.475579,56.736232,...,71.637979,53.619026,54.799635,f,50.049975
b,59.388551,0.000000,37.322915,100.757134,47.307505,...,69.949982,54.203321,70.851958,g,29.137605
c,56.160484,37.322915,0.000000,126.067442,73.287107,...,78.778170,79.037966,67.059675,g,28.879058
d,107.475579,100.757134,126.067442,0.000000,73.198361,...,85.819578,60.975405,132.770479,i,60.975405
e,56.736232,47.307505,73.287107,73.198361,0.000000,...,47.254629,21.771541,64.078077,i,21.771541
f,50.049975,72.814834,67.089492,101.242284,82.595399,...,92.967736,70.285134,100.568385,a,50.049975
g,50.139805,29.137605,28.879058,98.208961,53.131911,...,57.393379,56.824291,68.622154,c,28.879058
h,71.637979,69.949982,78.778170,85.819578,47.254629,...,0.000000,58.728187,65.030762,e,47.254629
i,53.619026,54.203321,79.037966,60.975405,21.771541,...,58.728187,0.000000,77.935871,e,21.771541
j,54.799635,70.851958,67.059675,132.770479,64.078077,...,65.030762,77.935871,0.000000,a,54.799635

In [67]:
# 61. How to know the maximum possible correlation value of each column against other columns?
# Difficulty Level: L2

# Compute maximum possible absolute correlation value of each column against other columns in df.

df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1), columns=list('pqrstuvwxy'), index=list('abcdefgh'))

corr_df = abs(df.corr())

max_corr_list = [(feature, 
                  (corr_df[feature].sort_values(ascending=False).index[1],
                   corr_df[feature].sort_values(ascending=False)[1]))
                 for feature in corr_df.columns]
max_corr_list

[('p', ('t', 0.7775076044216506)),
 ('q', ('u', 0.8066047472961108)),
 ('r', ('x', 0.8609582402239383)),
 ('s', ('v', 0.7007154364771065)),
 ('t', ('p', 0.7775076044216506)),
 ('u', ('q', 0.8066047472961108)),
 ('v', ('s', 0.7007154364771065)),
 ('w', ('q', 0.5961019395904815)),
 ('x', ('r', 0.8609582402239383)),
 ('y', ('q', 0.528478661868223))]

In [68]:
# 62. How to create a column containing the minimum by maximum of each row?
# Difficulty Level: L2

# Compute the minimum-by-maximum for every row of df.

df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

# Vectorlized

df['RowMinByMax'] = df.min(axis=0) / df.max(axis=0)
df.head()

    0   1   2   3   4  ...   6   7   8   9  RowMinByMax
0  44  88  59   2  31  ...  62  86  28  10     0.170213
1  16  14  45  73   3  ...  71  92  45  54     0.150538
2  41  82  64  17  33  ...  52  19  11  53     0.246575
3  88  68  44   2  74  ...  41  11   1  66     0.024691
4  94  93  18   6  70  ...  53  10  67   2     0.034884

[5 rows x 11 columns]

In [69]:
# 63. How to create a column that contains the penultimate value in each row?
# Difficulty Level: L2

# Create a new column 'penultimate' which has the second largest value of each row of df.
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

row_penultimate_collection = []
for row in df.index:
    row_penultimate = df.loc[row,:].sort_values().iloc[1]
    row_penultimate_collection.append(row_penultimate)
df['Row_Penultimate'] = row_penultimate_collection
df.head()

    0   1   2   3   4  ...   6   7   8   9  Row_Penultimate
0  50  33  71  59  86  ...  70  30  41  35               33
1  58  28  13  78  94  ...  64  59  62  56               16
2  32  42  47  90  41  ...   7   6  15  79                7
3   5  15  39  96  42  ...  86  73  23  85               15
4  90  88  95  93  72  ...  22  94  11  12               12

[5 rows x 11 columns]

In [70]:
# 64. How to normalize all columns in a dataframe?
# Difficulty Level: L2
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

# vectorlized
def Nomolize_df(df, minmax=False):
    tmp = df.copy()
    for col in tmp.columns:
        if not minmax:
            mean = tmp[col].mean()
            std = tmp[col].std()
            tmp[col] = (tmp[col] - mean) / std
        min_col = tmp[col].min()
        max_col = tmp[col].max()
        tmp[col] = (max_col - tmp[col]) / (max_col - min_col)
    return tmp

df_nor = Nomolize_df(df)
df_minmax = Nomolize_df(df, minmax=True)
display(df_nor,
       df_minmax)

,0,1,2,3,4,5,6,7,8,9
0,0.208955,0.043011,0.792208,0.329412,0.743902,0.906250,0.000000,1.000000,0.000000,0.3000
1,1.000000,0.236559,0.220779,0.000000,0.682927,0.500000,0.000000,0.000000,0.947368,0.5750
2,0.000000,0.827957,0.974026,0.047059,0.841463,0.729167,0.733333,0.405405,0.513158,0.1125
3,0.865672,0.000000,0.428571,0.717647,0.000000,0.000000,1.000000,0.459459,0.263158,0.2375
4,0.805970,0.043011,0.493506,1.000000,0.182927,0.208333,0.346667,0.756757,0.723684,1.0000
5,0.268657,1.000000,0.000000,0.894118,1.000000,0.875000,0.533333,0.581081,0.236842,0.8625
6,0.597015,0.139785,0.506494,0.576471,0.963415,0.447917,0.253333,0.445946,1.000000,0.9250
7,0.477612,0.795699,1.000000,0.094118,0.170732,1.000000,0.013333,0.513514,0.776316,0.0000

,0,1,2,3,4,5,6,7,8,9
0,0.208955,0.043011,0.792208,0.329412,0.743902,0.906250,0.000000,1.000000,0.000000,0.3000
1,1.000000,0.236559,0.220779,0.000000,0.682927,0.500000,0.000000,0.000000,0.947368,0.5750
2,0.000000,0.827957,0.974026,0.047059,0.841463,0.729167,0.733333,0.405405,0.513158,0.1125
3,0.865672,0.000000,0.428571,0.717647,0.000000,0.000000,1.000000,0.459459,0.263158,0.2375
4,0.805970,0.043011,0.493506,1.000000,0.182927,0.208333,0.346667,0.756757,0.723684,1.0000
5,0.268657,1.000000,0.000000,0.894118,1.000000,0.875000,0.533333,0.581081,0.236842,0.8625
6,0.597015,0.139785,0.506494,0.576471,0.963415,0.447917,0.253333,0.445946,1.000000,0.9250
7,0.477612,0.795699,1.000000,0.094118,0.170732,1.000000,0.013333,0.513514,0.776316,0.0000

In [71]:
# 65. How to compute the correlation of each row with the suceeding row?
# Difficulty Level: L2

# Compute the correlation of each row of df with its succeeding row.

df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

corr_list = []
for first_row_idx, second_row_idx in zip(df.index[:-1],
                                         df.index[1:]):
    first_row = df.iloc[first_row_idx,:]
    second_row = df.iloc[second_row_idx,:]

    corr_list.append(
        (first_row_idx, second_row_idx, first_row.corr(second_row))
    )
corr_list

[(0, 1, -0.00026608777470537746),
 (1, 2, 0.4137650205128434),
 (2, 3, 0.22723076277958235),
 (3, 4, 0.5233020498337693),
 (4, 5, -0.14701565414163723),
 (5, 6, -0.057633687781507674),
 (6, 7, -0.7044477811459052)]

In [72]:
# 66. How to replace both the diagonals of dataframe with 0?
# Difficulty Level: L2

# Replace both values in both diagonals of df with 0.

df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))

# More readable
np.fill_diagonal(df.values, 0)

df
# hint
# np.fill_diagonal 沒有return值, 
# 因此 new_array = np.fill_diagonal(df.values, 0), new_array會為None
# pd.DataFrame.values 只能呼叫，無法直接帶入值
# 因此 df.vales = np.fill_diagonal(df.values, 0) 不會work

    0   1   2   3   4   5   6   7   8   9
0   0  73  70  97  92  38  88  99  22  95
1  27   0  87  99  43  29  11  50  16   1
2  14   7   0  24  81  17  69   4   2  75
3  96   5  35   0   2  70  66  71   7   1
4  72  55  11  17   0  11  65  35  46  47
5  33  85  17  69  96   0  61  87  86  89
6  99  48  56  30  28   4   0  89  13  76
7  10   7  27  68  19  61  61   0  90  54
8  85  28  13  37  47  40  94  19   0  35
9   6  86  75  49  71  51  50  37  30   0

In [73]:
# 67. How to get the particular group of a groupby dataframe by key?
# Difficulty Level: L2

df = pd.DataFrame({'col1': ['apple', 'banana', 'orange'] * 3,
                   'col2': np.random.rand(9),
                   'col3': np.random.randint(0, 15, 9)})

df_grouped = df.groupby(['col1'])


df_grouped.get_group('apple')

# hint 使用 # print(dir(df_grouped)) 來呼叫groupby物件的所有屬性及方法
# hint 使用 以下 來呼叫groupby中所有非隱藏方法
# print([method for method in dir(df_grouped)
#                          if not method.startswith('_')])
# when to use
# 對於groupby的操作，在資料處理時使用頻率非常高，有了上面的hint
# 我們可以更有依據的查詢怎麼都出我們要的結果
# 會節省非常多時間在特徵工程上

    col1      col2  col3
0  apple  0.659388     2
3  apple  0.279251    12
6  apple  0.084111    14

In [74]:
# 68. How to get the n’th largest value of a column when grouped by another column?
# Difficulty Level: L2
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

df_apple = df.groupby(['fruit']).get_group('apple')
df_apple.sort_values(by='rating', ascending=False).iloc[1]

fruit        apple
rating    0.245578
price           12
Name: 3, dtype: object

In [75]:
# 69. How to compute grouped mean on pandas dataframe and keep the grouped column as another column (not index)?
# Difficulty Level: L1

# In df, Compute the mean price of every fruit, while keeping the fruit as another column instead of an index.

df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

df.groupby('fruit', as_index=False).mean()

    fruit    rating      price
0   apple  0.690677  11.666667
1  banana  0.372469   2.666667
2  orange  0.579505   8.666667

In [76]:
# 70. How to join two dataframes by 2 columns so they have only the common rows?
# Difficulty Level: L2

# Join dataframes df1 and df2 by ‘fruit-pazham’ and ‘weight-kilo’.


df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

pd.merge(df1, df2, left_on = ['fruit','weight'],
                    right_on = ['pazham','kilo'],
                    how = 'inner')

    fruit weight  price_x  pazham  kilo  price_y
0   apple   high        0   apple  high        7
1   apple   high        4   apple  high        7
2   apple   high       14   apple  high        7
3  orange    low        6  orange   low        2
4  orange    low        5  orange   low        2
5  orange    low        4  orange   low        2

In [77]:
# 71. How to remove rows from a dataframe that are present in another dataframe?
# Difficulty Level: L3

# From df1, remove the rows that are present in df2. All three columns must be the same.
df1 = pd.DataFrame({'fruit': ['apple', 'orange', 'banana'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.arange(9)})

df2 = pd.DataFrame({'fruit': ['apple', 'orange', 'pine'] * 2,
                    'weight': ['high', 'medium'] * 3,
                    'price': np.arange(6)})
display(df1,
       df2)
# More readable result
mask = ~ df1.isin(df2).all(axis='columns')
df1[mask]

    fruit  weight  price
0   apple    high      0
1  orange  medium      1
2  banana     low      2
3   apple    high      3
4  orange  medium      4
5  banana     low      5
6   apple    high      6
7  orange  medium      7
8  banana     low      8

    fruit  weight  price
0   apple    high      0
1  orange  medium      1
2    pine    high      2
3   apple  medium      3
4  orange    high      4
5    pine  medium      5

    fruit  weight  price
2  banana     low      2
3   apple    high      3
4  orange  medium      4
5  banana     low      5
6   apple    high      6
7  orange  medium      7
8  banana     low      8

In [78]:
# 72. How to get the positions where values of two columns match?
# Difficulty Level: L2
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})


np.where(df.fruit1 == df.fruit2)

# Hint
# 條件篩選 - np.where

(array([1, 3, 9]),)

In [79]:
# 73. How to create lags and leads of a column in a dataframe?

df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))

df = df.assign(aLag1 = df.a.shift(1),
               bLead1 = df.b.shift(-1))
df

    a   b   c   d  aLag1  bLead1
0  49  53  75  82    NaN    55.0
1  92  55  21  66   49.0    72.0
2  11  72   4  42   92.0    43.0
3  16  43  22  41   11.0    43.0
4  46  43  20  90   16.0     NaN

In [80]:
# 74. How to get the frequency of unique values in the entire dataframe?
# Difficulty Level: L2

# Get the frequency of unique values in the entire dataframe df.
df = pd.DataFrame(np.random.randint(1, 10, 20).reshape(-1, 4), columns = list('abcd'))

np.unique(df.values.reshape(1,-1), return_counts=True)

(array([2, 3, 5, 6, 7, 9]), array([2, 2, 4, 3, 3, 6]))

In [81]:
# 75. How to split a text column into two separate columns?
# Difficulty Level: L2

# Split the string column in df to form a dataframe with 3 columns as shown.
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])
# display(df)

df_out = df.row.str.split(',|\t', expand=True)

# Make first row as header
new_header = df_out.iloc[0]
df_out = df_out[1:]
df_out.columns = new_header
df_out

0 STD            City    State
1  33   Kolkata    West Bengal
2  44    Chennai    Tamil Nadu
3  40   Hyderabad    Telengana
4  80   Bangalore    Karnataka

# Some functionality you should know...

In [82]:
1.
# pd.DataFrame.melt
# Person 1, 2, 3 週一至週日的某數值
# make the dataframe display with -> columns:['weekday','PersonNo','Score']
data = {'weekday': ["Monday", "Tuesday", "Wednesday", 
         "Thursday", "Friday", "Saturday", "Sunday"],
        'Person 1': [12, 6, 5, 8, 11, 6, 4],
        'Person 2': [10, 6, 11, 5, 8, 9, 12],
        'Person 3': [8, 5, 7, 3, 7, 11, 15]}
df = pd.DataFrame(data, columns=['weekday',
        'Person 1', 'Person 2', 'Person 3'])

df_result = df.melt(id_vars=['weekday'],
                    value_vars=['Person 1','Person 2','Person 3'],
                    var_name='PersonNo',value_name='Score'
                    )
df_result.head()

# when to use
# 畫圖時經常會需要先melt, 當需要的欄位不在dataframe的值中而是在columns上或是index上時(pivot-table)
# 從 pivot-table 轉回tidy datframe (unpivot)

# ref
# https://deparkes.co.uk/2016/10/28/reshape-pandas-data-with-melt/

     weekday  PersonNo  Score
0     Monday  Person 1     12
1    Tuesday  Person 1      6
2  Wednesday  Person 1      5
3   Thursday  Person 1      8
4     Friday  Person 1     11

In [83]:
2.
# pd.DataFrame.melt
# 再一個例子
# make dataframe display like columns:['location','name','Date','Score']
data = {'location':['A','B'],
       'name':['test','foo'],
       'Jan-2010':[12,18],
       'Feb-2010':[20,20],
       'March-2010':[30,25]}
df = pd.DataFrame(data=data, columns=data.keys())

df.melt(id_vars=['location','name'],
       var_name='Date',
       value_name='Score')

  location  name        Date  Score
0        A  test    Jan-2010     12
1        B   foo    Jan-2010     18
2        A  test    Feb-2010     20
3        B   foo    Feb-2010     20
4        A  test  March-2010     30
5        B   foo  March-2010     25

In [84]:
# 3.
# unstack
# 處理multi-index
# make the MiltiIndex series display as tidy dataframe like : columns:['number','class','value']
index = pd.MultiIndex.from_tuples([('one', 'a'), ('one', 'b'),
                                    ('two', 'a'), ('two', 'b')])
s = pd.Series(np.arange(1.0, 5.0), index=index)

def get_tidy_df(s):
    tmp = s.unstack().reset_index().rename(columns={'index':'number'})
    tmp = tmp.melt(id_vars=['number'],
                   var_name=['class'],
                   value_name='value')
    return tmp

get_tidy_df(s)

  number class  value
0    one     a    1.0
1    two     a    3.0
2    one     b    2.0
3    two     b    4.0

In [85]:
# 4
# vectorlized your costum function for pandas 
# use the function without elementwise - operation
####### example
# import jieba
# result = [seg for seg in jieba.cut("我愛Python")]
# print(result)
####### Vectorlized Solution
####### This is provide extremly fast operation 
####### when you have large text need to deal with


# import jieba
# df = pd.DataFrame({'TextCol':['我愛Python','Python愛我','對我來說，R語言算什麼']})
# def segmentation(sentence : str) -> 'list':
#     '''
#     get segmentation of a sentence
#     '''
#     return [seg for seg in jieba.cut(sentence)]

# vec_segmentation = np.vectorize(segmentation, otypes=[list])
# vec_segmentation(df['TextCol'].values)
# df['Segmentation'] = vec_segmentation(df['TextCol'].values)
# df

# Hint : 使用 segmentation(df['TextCol']) 沒辦法過，series會出現無法encode
# 單純使用vectorlize也沒辦法過，錯誤訊息說我們想把一個sequence放進一個value
# 所以我們把output-type變為list，就可以被認得，如果你有一個100 million + 的dataframe需要做segmentation
# 這會比apply快上100倍
# efficiency https://engineering.upside.com/a-beginners-guide-to-optimizing-pandas-code-for-speed-c09ef2c6a4d6

In [86]:
# 5 
# need expand data in your df into columns?
# pivot -> reset_index() ->  columns.name = None
df = pd.DataFrame({
                   'imageId':['video10_image1','video10_image1','video10_image1',
                              'video10_image1','video10_image1'],
                   'label':['nose','left eye','right eye','left ear', 'right ear'],
                   'label_x':[177.0, 179.0, 179.0, 186.0, 188.0]
                  })
pivot = df.pivot(index='imageId',columns='label', values='label_x')
pivot_getIdx = pivot.reset_index()
display(df, 
       pivot,
       pivot_getIdx)
pivot_getIdx.columns.name = None
display('the most tricky part,actually "label" is a name of coumns instead of a column!',
        pivot_getIdx)
# More Readable -> add suffix
pivotMoreReadable = df.pivot(index='imageId',columns='label', values='label_x').add_suffix('_x').reset_index()
pivotMoreReadable.columns.name = None
display(pivotMoreReadable)

          imageId      label  label_x
0  video10_image1       nose    177.0
1  video10_image1   left eye    179.0
2  video10_image1  right eye    179.0
3  video10_image1   left ear    186.0
4  video10_image1  right ear    188.0

label           left ear  left eye   nose  right ear  right eye
imageId
video10_image1     186.0     179.0  177.0      188.0      179.0

label         imageId  left ear  left eye   nose  right ear  right eye
0      video10_image1     186.0     179.0  177.0      188.0      179.0

'the most tricky part,actually "label" is a name of coumns instead of a column!'

          imageId  left ear  left eye   nose  right ear  right eye
0  video10_image1     186.0     179.0  177.0      188.0      179.0

          imageId  left ear_x  left eye_x  nose_x  right ear_x  right eye_x
0  video10_image1       186.0       179.0   177.0        188.0        179.0

In [87]:
# 6 multiple merge
# pd.concat cannot do that!
# functional programming with pd.merge!
########### Create data ##########
FOLDER_DIR = './csvset'
for i in range(11):
    path = FOLDER_DIR + '/' + f'data_{i}.csv'
    pd.DataFrame(np.random.randint(low=5, high=100, size=(10,10))).\
    to_csv(path, index=False)
# read it
from glob import glob
DATA_PATH_LIST = glob('./csvset/*.csv')
PREFIX = 'data'
dfSet = {}
for idx, path in enumerate(DATA_PATH_LIST):
    df_name = PREFIX + f'_{idx}'
    dfSet[df_name] = pd.read_csv(path).add_prefix(f'{df_name}_').reset_index()
############ multiple merge #############
from functools import reduce
JOINKEY = 'index'
dfList = []
for _, df in dfSet.items():
    dfList.append(df)
df_all_merged = reduce(lambda left, right : pd.merge(left, right, on=JOINKEY), dfList)
display(df_all_merged.head())


# Hint, when you think about recussive solution -> functional programming might work

,index,data_0_0,data_0_1,data_0_2,data_0_3,...,data_10_5,data_10_6,data_10_7,data_10_8,data_10_9
0,0,81,90,72,14,...,57,95,9,50,76
1,1,30,64,58,53,...,40,57,27,33,85
2,2,11,69,32,11,...,50,9,97,43,29
3,3,59,48,75,96,...,23,85,28,50,50
4,4,42,19,87,91,...,37,77,28,91,9

# pandas tricks from Kevin Markham

In [88]:
# pandas tricks from Kevin Markham
# Does your Series contain lists of itrms?
# 1
df = pd.DataFrame({'sandwich':['PB&J','BLT','cheese'],
             'ingredients':[['peanut butter','jelly'],
                           ['bacon','lettuce','tomato'],
                           ['swiss cheese']]},
            index=['a','b','c'])

display(df)
df.explode('ingredients')
# Hint new method in 0.25
# Data Cleaning 時非常有用
# 尤其是從json格式讀取檔案時
# 同樣的方法在pd.Series當中也有

  sandwich               ingredients
a     PB&J    [peanut butter, jelly]
b      BLT  [bacon, lettuce, tomato]
c   cheese            [swiss cheese]

  sandwich    ingredients
a     PB&J  peanut butter
a     PB&J          jelly
b      BLT          bacon
b      BLT        lettuce
b      BLT         tomato
c   cheese   swiss cheese

In [89]:
# pandas tricks from Kevin Markham
# Does your Series contain comma-separation items?
# 2
df = pd.DataFrame({'sandwich':['PB&J','BLT','cheese'],
             'ingredients':['peanut butter,jelly',
                           'bacon,lettuce,tomato',
                           'swiss cheese']},
            index=['a','b','c'])

# More readable
# 使用assign
df.assign(
    ingredients = df.ingredients.str.split(',')).\
    explode('ingredients')

  sandwich    ingredients
a     PB&J  peanut butter
a     PB&J          jelly
b      BLT          bacon
b      BLT        lettuce
b      BLT         tomato
c   cheese   swiss cheese

In [90]:
# pandas tricks from Kevin Markham
# Does your Series contain comma-separation items?
# And you want to expand them to new columns
# 3
df = pd.DataFrame({'sandwich':['PB&J','BLT','cheese'],
             'ingredients':['peanut butter,jelly',
                           'bacon,lettuce,tomato',
                           'swiss cheese']},
            index=['a','b','c'])

# More readable
# 使用split, expand
# 使用add_prefix增加可讀性

df.ingredients.str.split(',', expand=True).\
add_prefix('ingredients_')

   ingredients_0 ingredients_1 ingredients_2
a  peanut butter         jelly          None
b          bacon       lettuce        tomato
c   swiss cheese          None          None

In [91]:
# pandas tricks from Kevin Markham
# Check your merge dataframe keys
# 4
df1 = pd.util.testing.makeMixedDataFrame()
df2 = df1.drop([2,3], axis='rows')

pd.merge(df1, df2, how='left',indicator=True)

/Users/YuLong/miniconda3/envs/py_37_ds/lib/python3.7/site-packages/pandas/util/__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     A    B     C          D     _merge
0  0.0  0.0  foo1 2009-01-01       both
1  1.0  1.0  foo2 2009-01-02       both
2  2.0  0.0  foo3 2009-01-05  left_only
3  3.0  1.0  foo4 2009-01-06  left_only
4  4.0  0.0  foo5 2009-01-07       both

In [92]:
# pandas tricks from Kevin Markham
# 5. agg of groupby
# hint
# 使用good的方法來避免多層的multi-index，tidy-form讓後續的分析更為方便
titanic = pd.read_csv('http://bit.ly/kaggletrain')
bad_idea = titanic.groupby('Pclass').agg({'Age':['mean','max'],
                                          'Survived':['mean']})
good = titanic.groupby('Pclass').agg(ave_age=('Age','mean'),
                                    max_age=('Age','max'),
                                    survival_rate=('Survived','mean'))
def tidy_groupby_df(df):
    tidy_df =  titanic.groupby('Pclass').agg(ave_age=('Age','mean'),
                                    max_age=('Age','max'),
                                    survival_rate=('Survived','mean'))

    return tidy_df.reset_index()

tidy_df = tidy_groupby_df(titanic)
    
display(bad_idea,
       good, 
        tidy_df)

              Age        Survived
             mean   max      mean
Pclass
1       38.233441  80.0  0.629630
2       29.877630  70.0  0.472826
3       25.140620  74.0  0.242363

          ave_age  max_age  survival_rate
Pclass
1       38.233441     80.0       0.629630
2       29.877630     70.0       0.472826
3       25.140620     74.0       0.242363

   Pclass    ave_age  max_age  survival_rate
0       1  38.233441     80.0       0.629630
1       2  29.877630     70.0       0.472826
2       3  25.140620     74.0       0.242363

In [93]:
# pandas tricks from Kevin Markham
# 6. read multiple csv file and keep in a dictionary
# create random data
FOLDER_DIR = './csvset'
for i in range(11):
    path = FOLDER_DIR + '/' + f'data_{i}.csv'
    pd.DataFrame(np.random.randint(low=5, high=100, size=(10,10))).\
    to_csv(path, index=False)
# read it
from glob import glob
DATA_PATH_LIST = glob('./csvset/*.csv')
PREFIX = 'data'
dfSet = {}
for idx, path in enumerate(DATA_PATH_LIST):
    df_name = PREFIX + f'_{idx}'
    dfSet[df_name] = pd.read_csv(path)
    display(df_name,
           dfSet[df_name].head(2))

'data_0'

    0   1   2   3   4   5   6   7   8   9
0  29  63  81  26  15  13  66  70   5  15
1  12  69   5  29  19  22  78  37  84  18

'data_1'

    0   1   2   3   4   5   6   7   8   9
0  72  74  42  28  86  94  57  36  56  66
1  41   6  51  68   5  43   9  31  40   6

'data_2'

    0   1   2   3   4   5   6   7   8   9
0  67  12  97   6  86  39  27  89   6  91
1  43  19  50  48  16  32  26  85  59  41

'data_3'

    0   1   2   3   4   5   6   7   8   9
0  97  56  32  89  39  82  39  11  43  39
1  27  53  63  94  15  62  19  87  49  58

'data_4'

    0   1   2   3   4   5   6   7   8   9
0  10  64  11  88  81  38  62  48   7  69
1  95  47  98  41  85  31   5  54  81  72

'data_5'

    0   1   2   3   4   5   6   7   8   9
0  28  32  78  93  92  56  15  67  67  30
1  18  62  35  88  95  45  87  21  60  44

'data_6'

    0   1   2   3   4   5   6   7   8   9
0  38  31   8  48  35  82  69  68  54  32
1  92  27  95  25  23  18  27  35  59  91

'data_7'

    0   1   2   3   4   5   6   7   8   9
0  89  22  67  20  54  61  84  48  55  26
1  70  99  57  12  32  75   6  85  96  24

'data_8'

    0   1   2   3   4   5   6   7   8   9
0  12  62  64  29  69  14  25  35  94  90
1  68  44  90  14  31  10  99  15  25  87

'data_9'

    0   1   2   3   4   5   6   7   8   9
0  36  65  74  28  21  94  29  59  90  87
1  11  99  39  57  93  67  66  90  22  48

'data_10'

    0   1   2   3   4   5   6   7   8   9
0   6  13   9  10  55  94  44  59  64  83
1  32  41  46  14  65  88   8  38  70  56

In [94]:
# pandas tricks from Kevin Markham
# 6-1 read multiple csv file and keep in a dictionary
# create random data
FOLDER_DIR = './csvset'
for i in range(11):
    path = FOLDER_DIR + '/' + f'data_{i}.csv'
    pd.DataFrame(np.random.randint(low=5, high=100, size=(10,10))).\
    to_csv(path, index=False)
# concat it
from glob import glob
DATA_PATH_LIST = glob('./csvset/*.csv')
dfList = [pd.read_csv(file) for file in DATA_PATH_LIST]

# concat
pd.concat(dfList, ignore_index=True)

      0   1   2   3   4   5   6   7   8   9
0    67  68  49  25  51  94  10  69  60  48
1    45   8  34  96  88  92   6  12  70  40
2    10  43  89  90  63   5  98  44  24  79
3    18  75  19  34  12  33  53  83  65  68
4    36  32  85  72  14  37  97  92  66  51
..   ..  ..  ..  ..  ..  ..  ..  ..  ..  ..
105  43  43  51  57  25  21  51  84  96  87
106  56  51  72  83  36  75  26  16  55  36
107  99  95  58  24  78  79  66  92  32  23
108  13  24  92  79  14  79  83  25  19  23
109  30  46  24  76  65  53  91  56  28  24

[110 rows x 10 columns]

In [95]:
# pandas tricks from Kevin Markham
# Miltiple filter creteria can be hard to write and read
df = pd.read_csv('http://bit.ly/drinksbycountry')
# save as object and use reduce 
crit1 = df.continent == 'Europe'
crit2 = df.beer_servings > 200
crit3 = df.wine_servings > 200
crit4 = df.spirit_servings > 100
from functools import reduce
criteria = reduce(lambda x, y : x & y, [crit1, crit2, crit3, crit4])
df[criteria]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
3,Andorra,245,138,312,12.4,Europe
99,Luxembourg,236,133,271,11.4,Europe

In [96]:
# pandas tricks from Kevin Markham
# mash up cat and wl , read_csv skiprows, header

# step 1 (find file) ! ls ./csvset/data_0.csv
! cat ./csvset/data_0.csv # step 2 , take a look
# ! wc -l ./csvset/data_0.csv # step 3 count all rows if you want to
pd.read_csv('./csvset/data_0.csv',header=0)

0,1,2,3,4,5,6,7,8,9
67,68,49,25,51,94,10,69,60,48
45,8,34,96,88,92,6,12,70,40
10,43,89,90,63,5,98,44,24,79
18,75,19,34,12,33,53,83,65,68
36,32,85,72,14,37,97,92,66,51
73,21,94,99,26,11,58,44,17,14
38,30,86,57,25,14,69,9,84,11
97,98,58,67,31,10,23,44,77,40
97,83,58,50,41,16,5,94,39,27
54,15,92,91,42,74,29,53,23,89

    0   1   2   3   4   5   6   7   8   9
0  67  68  49  25  51  94  10  69  60  48
1  45   8  34  96  88  92   6  12  70  40
2  10  43  89  90  63   5  98  44  24  79
3  18  75  19  34  12  33  53  83  65  68
4  36  32  85  72  14  37  97  92  66  51
5  73  21  94  99  26  11  58  44  17  14
6  38  30  86  57  25  14  69   9  84  11
7  97  98  58  67  31  10  23  44  77  40
8  97  83  58  50  41  16   5  94  39  27
9  54  15  92  91  42  74  29  53  23  89

In [97]:
# pandas tricks from Kevin Markham
# remove a column from a DataFrame and store it as a separate Series?
# use pop
df = pd.DataFrame([('falcon', 'bird', 389.0),
                    ('parrot', 'bird', 24.0),
                    ('lion', 'mammal', 80.5),
                    ('monkey','mammal', np.nan)],
                   columns=('name', 'class', 'max_speed'))
display(df.shape)
popped_series = df.pop('max_speed')
display(df.shape,
       popped_series.head())

(4, 3)

(4, 2)

0    389.0
1     24.0
2     80.5
3      NaN
Name: max_speed, dtype: float64

In [98]:
# pandas tricks from Kevin Markham
# Do you need to build a DataFrame from multiple files,
# but also keep track of which row came from which file?

from glob import glob
DATA_PATH_LIST = glob('./csvset/*.csv')
print(DATA_PATH_LIST)
# use generator expression
csv_geberator = (pd.read_csv(file).assign(file_name = file)
                 for file in DATA_PATH_LIST)

# concat
pd.concat(csv_geberator, ignore_index=True)

['./csvset/data_0.csv', './csvset/data_1.csv', './csvset/data_10.csv', './csvset/data_2.csv', './csvset/data_3.csv', './csvset/data_4.csv', './csvset/data_5.csv', './csvset/data_6.csv', './csvset/data_7.csv', './csvset/data_8.csv', './csvset/data_9.csv']

      0   1   2   3   4  ...   6   7   8   9            file_name
0    67  68  49  25  51  ...  10  69  60  48  ./csvset/data_0.csv
1    45   8  34  96  88  ...   6  12  70  40  ./csvset/data_0.csv
2    10  43  89  90  63  ...  98  44  24  79  ./csvset/data_0.csv
3    18  75  19  34  12  ...  53  83  65  68  ./csvset/data_0.csv
4    36  32  85  72  14  ...  97  92  66  51  ./csvset/data_0.csv
..   ..  ..  ..  ..  ..  ...  ..  ..  ..  ..                  ...
105  43  43  51  57  25  ...  51  84  96  87  ./csvset/data_9.csv
106  56  51  72  83  36  ...  26  16  55  36  ./csvset/data_9.csv
107  99  95  58  24  78  ...  66  92  32  23  ./csvset/data_9.csv
108  13  24  92  79  14  ...  83  25  19  23  ./csvset/data_9.csv
109  30  46  24  76  65  ...  91  56  28  24  ./csvset/data_9.csv

[110 rows x 11 columns]

In [99]:
# pandas tricks from Kevin Markham
# create a training set dtype_validator?
# 1 Create a CSV of column names & dtypes
# 2 Read it into a DataFrame, then convery it into a dictionary
# Use the dictionary to specify dtypes of the data

# When to use? 
# you have 50+ columns from different source and device....
# Why we use a pickle for dictionary? 
# we need to pick one readable for human, makes more maintainable
# we pick json instead of csv, because json is smaller
# hints : json only takes double quote, single quote is invalid...
import json
with open('validator_reference/column_dtypes.json', 'r') as file:
    dtypes = json.loads(file.read())
df = pd.read_csv('http://bit.ly/drinksbycountry', dtype=dtypes)
display(df.dtypes)

country                           object
beer_servings                      int64
spirit_servings                    int64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

In [100]:
# pandas tricks from Kevin Markham
# read  big csv into data-frame?
# Randomly sample the dataset  *during file reading* by *skiprows*

# create the data if not exist
import os 
if 'huge_dataset.csv' not in os.listdir('./csvset'):
    data = np.random.uniform(0, 1, (100000, 100))
    pd.DataFrame(data).to_csv('./csvset/huge_dataset.csv', index=False)


# neat
print('we have 100000 raws huge data!')
df = pd.read_csv('./csvset/huge_dataset.csv', 
                skiprows = lambda x : x > 0 and np.random.rand() > 0.01)

print('sample data with fraction 1 %',df.shape)

# clearn the data
import subprocess

delete_file = 'rm ./csvset/huge_dataset.csv'
subprocess.run(delete_file, shell=True, check=True)

we have 100000 raws huge data!
sample data with fraction 1 % (1015, 100)

CompletedProcess(args='rm ./csvset/huge_dataset.csv', returncode=0)

## How it works?
* `skiprows` accepts a function that is evaluated against the integer index
* `x > 0`ensures that the header row is **not** skipped
* `np.random.rand() > 0.01` return **True** 99% of the time, thus skip 99% of the rows
### different with sample
* `sample` need whole dataset in dataframe!

In [101]:
# pandas tricks from Kevin Markham
# Want to convert "year" and "day of year" into a single datetime column? 📆
# 1. Combine them into one number
# 2. Convert to datetime and specify its format

df = pd.DataFrame({'year':[2019,2019,2020],
                  'day_of_yesr':[350, 365, 1]})

# step 1 
df['combined'] = df['year'] * 1000 + df['day_of_yesr']

# step 2
df['date'] = pd.to_datetime(df['combined'], format='%Y%j')
df

   year  day_of_yesr  combined       date
0  2019          350   2019350 2019-12-16
1  2019          365   2019365 2019-12-31
2  2020            1   2020001 2020-01-01

# pandas trick from LeeMeng

In [102]:
# 找出符合特定字串的樣本

df = pd.read_csv('http://bit.ly/kaggletrain')
df[df.Name.str.contains("Mr\.")].head(5)

,PassengerId,Survived,Pclass,Name,Sex,...,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,...,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,...,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,...,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,...,0,17463,51.8625,E46,S
12,13,0,3,"Saundercock, Mr. William Henry",male,...,0,A/5. 2151,8.0500,NaN,S

In [103]:
# 用正規表達式來選data
# 尤其是時間序列

df_date = pd.util.testing.makeTimeDataFrame(freq='7D')
df_date.head(10)

                   A         B         C         D
2000-01-01  0.952689  0.623642  0.533543 -0.353059
2000-01-08 -0.360159  1.638353 -0.452233  1.171051
2000-01-15  1.158313 -0.591046 -0.365697 -0.581622
2000-01-22  2.067041  0.940603  0.117704 -0.584242
2000-01-29  0.126129 -0.249779  0.106967  1.289173
2000-02-05 -1.115236 -0.494480 -0.930937  1.162510
2000-02-12  0.075595 -0.422626 -1.221407  0.342345
2000-02-19 -0.967893 -1.225866 -0.138864 -2.540966
2000-02-26  0.161288  0.502452 -0.913916  0.705007
2000-03-04 -1.914011  0.591385 -0.826484  1.086742

In [104]:
# a more readable way to filter by index with alomst any operatioms
df_date.filter(regex="2000-02.*", axis=0)

                   A         B         C         D
2000-02-05 -1.115236 -0.494480 -0.930937  1.162510
2000-02-12  0.075595 -0.422626 -1.221407  0.342345
2000-02-19 -0.967893 -1.225866 -0.138864 -2.540966
2000-02-26  0.161288  0.502452 -0.913916  0.705007

In [105]:
# 選取從某段時間開始的區間樣本
#        df_date.between_time(start_time=datetime(2000, 2, 5),
#                           end_time=datetime(2000, 3, 19))
# will not work
# do a old school way
from datetime import datetime
def between(df : pd.DataFrame, 
            start_date : datetime,
            end_date : datetime,
           *args) -> pd.DataFrame:
    assert isinstance(df.index, pd.DatetimeIndex), 'index is not DatetimeIndex format'
    mask = (df.index > start_date) & (df.index <= end_date)
    return df[mask]
    

display(df_date.first('3W'),
       between(df_date,start_date=datetime(2000,1, 15),
              end_date=datetime(2000, 3, 10)))

                   A         B         C         D
2000-01-01  0.952689  0.623642  0.533543 -0.353059
2000-01-08 -0.360159  1.638353 -0.452233  1.171051
2000-01-15  1.158313 -0.591046 -0.365697 -0.581622

                   A         B         C         D
2000-01-22  2.067041  0.940603  0.117704 -0.584242
2000-01-29  0.126129 -0.249779  0.106967  1.289173
2000-02-05 -1.115236 -0.494480 -0.930937  1.162510
2000-02-12  0.075595 -0.422626 -1.221407  0.342345
2000-02-19 -0.967893 -1.225866 -0.138864 -2.540966
2000-02-26  0.161288  0.502452 -0.913916  0.705007
2000-03-04 -1.914011  0.591385 -0.826484  1.086742

In [106]:
# for loop but want multiple row
df_city = pd.DataFrame({
    'state': ['密蘇里州', '亞利桑那州', '肯塔基州', '紐約州'],
    'city': ['堪薩斯城', '鳳凰城', '路易維爾', '紐約市']
})

for row in df_city.itertuples(name='City'):
    print(f'{row.city}是{row.state}裡頭的一個城市')

    
# itertuples is exactly namedtuple
from collections import namedtuple

City = namedtuple('City', ['Index', 'state', 'city'])
c = City(3, '紐約州', '紐約市')
c == row

堪薩斯城是密蘇里州裡頭的一個城市
鳳凰城是亞利桑那州裡頭的一個城市
路易維爾是肯塔基州裡頭的一個城市
紐約市是紐約州裡頭的一個城市

True

In [107]:
# swifter, star 1.2k, then might be well tested
# https://github.com/jmcarpenter2/swifter
# use swifter auto vectorlization of your code
# but keep your ability to write vectorlize code :P
# actually apply support numba backend now!

import swifter
df = pd.DataFrame(pd.np.random.rand(1000000, 1), columns=['x'])

%timeit -n 10 df['x2'] = df['x'].apply(lambda x: x**2)
%timeit -n 10 df['x2'] = df['x'].swifter.apply(lambda x: x**2)

656 ms ± 138 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
17.5 ms ± 3.72 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)